Podkova/src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/СтатьиАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиАктивовПассивов</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Партнеры</types>
    <types>EnumRef.ТипыНалогов</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>EnumRef.СтатьиБезАналитики</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Склады</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
      <code>УТ-00000023</code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>УТ-00000020</code>
    </items>
    <items>
      <name>ДоходыТекущегоПериода</name>
      <description>Доходы текущего периода</description>
      <code>УТ-00000042</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
    <items>
      <name>ИсточникиФинансирования</name>
      <description>Источники финансирования</description>
      <code>УТ-00000038</code>
      </content>
    </items>
    <items>
      <name>КредиторскаяЗадолженность</name>
      <description>Кредиторская задолженность</description>
      <code>УТ-00000024</code>
    </items>
    <items>
      <name>НезавершенноеПроизводство</name>
      <description>Незавершенное производство</description>
      <code>УТ-00000029</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>УТ-00000016</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
    <items>
      <name>ГруппаПрочиеАктивы</name>
      <description>Прочие активы</description>
      <code>УТ-00000047</code>
    </items>
    <items>
      <name>ГруппаПрочиеПассивы</name>
      <description>Прочие пассивы</description>
      <code>УТ-00000048</code>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>УТ-00000015</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
    <items>
      <name>РасходыТекущегоПериода</name>
      <description>Расходы текущего периода</description>
      <code>УТ-00000014</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>УТ-00000027</code>
    </items>
    <items>
      <name>ТоварыКОформлениюОтчетовКомитенту</name>
      <description>Товары к оформлению отчетов комитенту</description>
      <code>УТ-00000043</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
    <items>
      <name>УслугиКОформлениюОтчетовПринципалу</name>
      <description>Услуги к оформлению отчетов принципалу</description>
      <code>УТ-00000055</code>
      <type>
        <types>EnumRef.СтатьиБезАналитики</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктивПассив</name>
    <type>
      <types>EnumRef.ВидыСтатейУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьОборот</name>
    <comment>Управляет показом оборота в отчете &quot;Управленческий баланс&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДебетаСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКредитаСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

Podkova/src/Enums/ВидыСтатейУправленческогоБаланса/ВидыСтатейУправленческогоБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатейУправленческогоБаланса</name>
  <enumValues>
    <name>Актив</name>
  </enumValues>
  <enumValues>
    <name>Пассив</name>
  </enumValues>
  <enumValues>
    <name>АктивПассив</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/Forms/ФормаВыбораСтатьиИАналитики/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("АктивПассив") Тогда
		ПризнакАктивПассив = Параметры.АктивПассив;
		Если ПризнакАктивПассив = Перечисления.ВидыСтатейУправленческогоБаланса.Актив Тогда
			Элементы.Статья.Заголовок = НСтр("ru='Статья активов'");
			Заголовок = НСтр("ru='Выбор статьи активов и аналитики'");
		Иначе
			Элементы.Статья.Заголовок = НСтр("ru='Статья пассивов'");
			Заголовок = НСтр("ru='Выбор статьи пассивов и аналитики'");
		КонецЕсли;
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.АктивПассив", Параметры.АктивПассив);
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(ПараметрВыбора);
		Элементы.Статья.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	Иначе
		Заголовок = НСтр("ru='Выбор статьи и аналитики'");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Параметр = Новый Структура("Статья, Аналитика", СтатьяАктивовПассивов, АналитикаАктивовПассивов);
		Закрыть(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
